{
  "Ketu_Ketu": "During Ketu Mahadasha and Ketu Antardasha, lean into detachment, intuition, past-life skills; avoid confusion, isolation, aimlessness.",
  "Ketu_Venus": "During Ketu Mahadasha and Venus Antardasha, lean into relationships, creativity, comfort; avoid indulgence, distractions, emotional dependency.",
  "Ketu_Sun": "During Ketu Mahadasha and Sun Antardasha, lean into leadership, confidence, visibility; avoid ego, authoritarianism, conflicts.",
  "Ketu_Moon": "During Ketu Mahadasha and Moon Antardasha, lean into intuition, nurturing, adaptability; avoid mood swings, insecurity, dependency.",
  "Ketu_Mars": "During Ketu Mahadasha and Mars Antardasha, lean into action, courage, willpower; avoid anger, aggression, haste.",
  "Ketu_Rahu": "During Ketu Mahadasha and Rahu Antardasha, lean into innovation, ambition, foreign gains; avoid illusion, obsession, restlessness.",
  "Ketu_Jupiter": "During Ketu Mahadasha and Jupiter Antardasha, lean into wisdom, expansion, teaching; avoid overconfidence, dogma, missed details.",
  "Ketu_Saturn": "During Ketu Mahadasha and Saturn Antardasha, lean into discipline, patience, hard work; avoid delays, pressure, fear.",
  "Ketu_Mercury": "During Ketu Mahadasha and Mercury Antardasha, lean into intellect, business, communication; avoid overthinking, inconsistency, anxiety.",
  "Venus_Ketu": "During Venus Mahadasha and Ketu Antardasha, lean into detachment, intuition, past-life skills; avoid confusion, isolation, aimlessness.",
  "Venus_Venus": "During Venus Mahadasha and Venus Antardasha, lean into relationships, creativity, comfort; avoid indulgence, distractions, emotional dependency.",
  "Venus_Sun": "During Venus Mahadasha and Sun Antardasha, lean into leadership, confidence, visibility; avoid ego, authoritarianism, conflicts.",
  "Venus_Moon": "During Venus Mahadasha and Moon Antardasha, lean into intuition, nurturing, adaptability; avoid mood swings, insecurity, dependency.",
  "Venus_Mars": "During Venus Mahadasha and Mars Antardasha, lean into action, courage, willpower; avoid anger, aggression, haste.",
  "Venus_Rahu": "During Venus Mahadasha and Rahu Antardasha, lean into innovation, ambition, foreign gains; avoid illusion, obsession, restlessness.",
  "Venus_Jupiter": "During Venus Mahadasha and Jupiter Antardasha, lean into wisdom, expansion, teaching; avoid overconfidence, dogma, missed details.",
  "Venus_Saturn": "During Venus Mahadasha and Saturn Antardasha, lean into discipline, patience, hard work; avoid delays, pressure, fear.",
  "Venus_Mercury": "During Venus Mahadasha and Mercury Antardasha, lean into intellect, business, communication; avoid overthinking, inconsistency, anxiety.",
  "Sun_Ketu": "During Sun Mahadasha and Ketu Antardasha, lean into detachment, intuition, past-life skills; avoid confusion, isolation, aimlessness.",
  "Sun_Venus": "During Sun Mahadasha and Venus Antardasha, lean into relationships, creativity, comfort; avoid indulgence, distractions, emotional dependency.",
  "Sun_Sun": "During Sun Mahadasha and Sun Antardasha, lean into leadership, confidence, visibility; avoid ego, authoritarianism, conflicts.",
  "Sun_Moon": "During Sun Mahadasha and Moon Antardasha, lean into intuition, nurturing, adaptability; avoid mood swings, insecurity, dependency.",
  "Sun_Mars": "During Sun Mahadasha and Mars Antardasha, lean into action, courage, willpower; avoid anger, aggression, haste.",
  "Sun_Rahu": "During Sun Mahadasha and Rahu Antardasha, lean into innovation, ambition, foreign gains; avoid illusion, obsession, restlessness.",
  "Sun_Jupiter": "During Sun Mahadasha and Jupiter Antardasha, lean into wisdom, expansion, teaching; avoid overconfidence, dogma, missed details.",
  "Sun_Saturn": "During Sun Mahadasha and Saturn Antardasha, lean into discipline, patience, hard work; avoid delays, pressure, fear.",
  "Sun_Mercury": "During Sun Mahadasha and Mercury Antardasha, lean into intellect, business, communication; avoid overthinking, inconsistency, anxiety.",
  "Moon_Ketu": "During Moon Mahadasha and Ketu Antardasha, lean into detachment, intuition, past-life skills; avoid confusion, isolation, aimlessness.",
  "Moon_Venus": "During Moon Mahadasha and Venus Antardasha, lean into relationships, creativity, comfort; avoid indulgence, distractions, emotional dependency.",
  "Moon_Sun": "During Moon Mahadasha and Sun Antardasha, lean into leadership, confidence, visibility; avoid ego, authoritarianism, conflicts.",
  "Moon_Moon": "During Moon Mahadasha and Moon Antardasha, lean into intuition, nurturing, adaptability; avoid mood swings, insecurity, dependency.",
  "Moon_Mars": "During Moon Mahadasha and Mars Antardasha, lean into action, courage, willpower; avoid anger, aggression, haste.",
  "Moon_Rahu": "During Moon Mahadasha and Rahu Antardasha, lean into innovation, ambition, foreign gains; avoid illusion, obsession, restlessness.",
  "Moon_Jupiter": "During Moon Mahadasha and Jupiter Antardasha, lean into wisdom, expansion, teaching; avoid overconfidence, dogma, missed details.",
  "Moon_Saturn": "During Moon Mahadasha and Saturn Antardasha, lean into discipline, patience, hard work; avoid delays, pressure, fear.",
  "Moon_Mercury": "During Moon Mahadasha and Mercury Antardasha, lean into intellect, business, communication; avoid overthinking, inconsistency, anxiety.",
  "Mars_Ketu": "During Mars Mahadasha and Ketu Antardasha, lean into detachment, intuition, past-life skills; avoid confusion, isolation, aimlessness.",
  "Mars_Venus": "During Mars Mahadasha and Venus Antardasha, lean into relationships, creativity, comfort; avoid indulgence, distractions, emotional dependency.",
  "Mars_Sun": "During Mars Mahadasha and Sun Antardasha, lean into leadership, confidence, visibility; avoid ego, authoritarianism, conflicts.",
  "Mars_Moon": "During Mars Mahadasha and Moon Antardasha, lean into intuition, nurturing, adaptability; avoid mood swings, insecurity, dependency.",
  "Mars_Mars": "During Mars Mahadasha and Mars Antardasha, lean into action, courage, willpower; avoid anger, aggression, haste.",
  "Mars_Rahu": "During Mars Mahadasha and Rahu Antardasha, lean into innovation, ambition, foreign gains; avoid illusion, obsession, restlessness.",
  "Mars_Jupiter": "During Mars Mahadasha and Jupiter Antardasha, lean into wisdom, expansion, teaching; avoid overconfidence, dogma, missed details.",
  "Mars_Saturn": "During Mars Mahadasha and Saturn Antardasha, lean into discipline, patience, hard work; avoid delays, pressure, fear.",
  "Mars_Mercury": "During Mars Mahadasha and Mercury Antardasha, lean into intellect, business, communication; avoid overthinking, inconsistency, anxiety.",
  "Rahu_Ketu": "During Rahu Mahadasha and Ketu Antardasha, lean into detachment, intuition, past-life skills; avoid confusion, isolation, aimlessness.",
  "Rahu_Venus": "During Rahu Mahadasha and Venus Antardasha, lean into relationships, creativity, comfort; avoid indulgence, distractions, emotional dependency.",
  "Rahu_Sun": "During Rahu Mahadasha and Sun Antardasha, lean into leadership, confidence, visibility; avoid ego, authoritarianism, conflicts.",
  "Rahu_Moon": "During Rahu Mahadasha and Moon Antardasha, lean into intuition, nurturing, adaptability; avoid mood swings, insecurity, dependency.",
  "Rahu_Mars": "During Rahu Mahadasha and Mars Antardasha, lean into action, courage, willpower; avoid anger, aggression, haste.",
  "Rahu_Rahu": "During Rahu Mahadasha and Rahu Antardasha, lean into innovation, ambition, foreign gains; avoid illusion, obsession, restlessness.",
  "Rahu_Jupiter": "During Rahu Mahadasha and Jupiter Antardasha, lean into wisdom, expansion, teaching; avoid overconfidence, dogma, missed details.",
  "Rahu_Saturn": "During Rahu Mahadasha and Saturn Antardasha, lean into discipline, patience, hard work; avoid delays, pressure, fear.",
  "Rahu_Mercury": "During Rahu Mahadasha and Mercury Antardasha, lean into intellect, business, communication; avoid overthinking, inconsistency, anxiety.",
  "Jupiter_Ketu": "During Jupiter Mahadasha and Ketu Antardasha, lean into detachment, intuition, past-life skills; avoid confusion, isolation, aimlessness.",
  "Jupiter_Venus": "During Jupiter Mahadasha and Venus Antardasha, lean into relationships, creativity, comfort; avoid indulgence, distractions, emotional dependency.",
  "Jupiter_Sun": "During Jupiter Mahadasha and Sun Antardasha, lean into leadership, confidence, visibility; avoid ego, authoritarianism, conflicts.",
  "Jupiter_Moon": "During Jupiter Mahadasha and Moon Antardasha, lean into intuition, nurturing, adaptability; avoid mood swings, insecurity, dependency.",
  "Jupiter_Mars": "During Jupiter Mahadasha and Mars Antardasha, lean into action, courage, willpower; avoid anger, aggression, haste.",
  "Jupiter_Rahu": "During Jupiter Mahadasha and Rahu Antardasha, lean into innovation, ambition, foreign gains; avoid illusion, obsession, restlessness.",
  "Jupiter_Jupiter": "During Jupiter Mahadasha and Jupiter Antardasha, lean into wisdom, expansion, teaching; avoid overconfidence, dogma, missed details.",
  "Jupiter_Saturn": "During Jupiter Mahadasha and Saturn Antardasha, lean into discipline, patience, hard work; avoid delays, pressure, fear.",
  "Jupiter_Mercury": "During Jupiter Mahadasha and Mercury Antardasha, lean into intellect, business, communication; avoid overthinking, inconsistency, anxiety.",
  "Saturn_Ketu": "During Saturn Mahadasha and Ketu Antardasha, lean into detachment, intuition, past-life skills; avoid confusion, isolation, aimlessness.",
  "Saturn_Venus": "During Saturn Mahadasha and Venus Antardasha, lean into relationships, creativity, comfort; avoid indulgence, distractions, emotional dependency.",
  "Saturn_Sun": "During Saturn Mahadasha and Sun Antardasha, lean into leadership, confidence, visibility; avoid ego, authoritarianism, conflicts.",
  "Saturn_Moon": "During Saturn Mahadasha and Moon Antardasha, lean into intuition, nurturing, adaptability; avoid mood swings, insecurity, dependency.",
  "Saturn_Mars": "During Saturn Mahadasha and Mars Antardasha, lean into action, courage, willpower; avoid anger, aggression, haste.",
  "Saturn_Rahu": "During Saturn Mahadasha and Rahu Antardasha, lean into innovation, ambition, foreign gains; avoid illusion, obsession, restlessness.",
  "Saturn_Jupiter": "During Saturn Mahadasha and Jupiter Antardasha, lean into wisdom, expansion, teaching; avoid overconfidence, dogma, missed details.",
  "Saturn_Saturn": "During Saturn Mahadasha and Saturn Antardasha, lean into discipline, patience, hard work; avoid delays, pressure, fear.",
  "Saturn_Mercury": "During Saturn Mahadasha and Mercury Antardasha, lean into intellect, business, communication; avoid overthinking, inconsistency, anxiety.",
  "Mercury_Ketu": "During Mercury Mahadasha and Ketu Antardasha, lean into detachment, intuition, past-life skills; avoid confusion, isolation, aimlessness.",
  "Mercury_Venus": "During Mercury Mahadasha and Venus Antardasha, lean into relationships, creativity, comfort; avoid indulgence, distractions, emotional dependency.",
  "Mercury_Sun": "During Mercury Mahadasha and Sun Antardasha, lean into leadership, confidence, visibility; avoid ego, authoritarianism, conflicts.",
  "Mercury_Moon": "During Mercury Mahadasha and Moon Antardasha, lean into intuition, nurturing, adaptability; avoid mood swings, insecurity, dependency.",
  "Mercury_Mars": "During Mercury Mahadasha and Mars Antardasha, lean into action, courage, willpower; avoid anger, aggression, haste.",
  "Mercury_Rahu": "During Mercury Mahadasha and Rahu Antardasha, lean into innovation, ambition, foreign gains; avoid illusion, obsession, restlessness.",
  "Mercury_Jupiter": "During Mercury Mahadasha and Jupiter Antardasha, lean into wisdom, expansion, teaching; avoid overconfidence, dogma, missed details.",
  "Mercury_Saturn": "During Mercury Mahadasha and Saturn Antardasha, lean into discipline, patience, hard work; avoid delays, pressure, fear.",
  "Mercury_Mercury": "During Mercury Mahadasha and Mercury Antardasha, lean into intellect, business, communication; avoid overthinking, inconsistency, anxiety."
}